feat: use mermaid diagrams in documentation
